
Процедура EPA_СобытияЗаписиПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Данные = РегистрыСведений.EPA_НастройкиПользователей.ПолучитьДанныеПользователя(ТекущийПользователь);
	Если Данные <> Неопределено Тогда 
		Если EPA_ВзаимодействиеHTTP.ПодтвердитьДействие() Тогда 
			Отказ = Ложь;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура EPA_СобытияПроведенияОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт

	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Данные = РегистрыСведений.EPA_НастройкиПользователей.ПолучитьДанныеПользователя(ТекущийПользователь);
	Если Данные <> Неопределено Тогда 
		Если EPA_ВзаимодействиеHTTP.ПодтвердитьДействие() Тогда 
			Отказ = Ложь;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры