
&НаКлиенте
Процедура ПриОткрытии(Отказ)     
	
	ТаймерБар = 0;
	ОбновлениеКода();
	ПодключитьОбработчикОжидания("ОбновлениеБара", 1);
	ПодключитьОбработчикОжидания("ОбновлениеКода", 30);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбновлениеКода() Экспорт
	
	ГСЧ = Новый ГенераторСлучайныхЧисел();
	ЛокКод = Неопределено;
	ЛокКод = ГСЧ.СлучайноеЧисло(0, 999999);
	Код = Формат(ЛокКод, "ЧЦ=6; ЧРД=; ЧРГ=' '; ЧН='000 000'; ЧВН=; ЧГ=3,0"); 
	ТаймерБар = 0;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ОбновлениеБара() Экспорт
	
    ТаймерБар = ТаймерБар + 1; 
	
КонецПроцедуры
