#Область ОбработчикиСобытийФормы   

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	EPA_URL = Константы.EPA_URL.Получить();
	БазовыйURL = EPA_URL;
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Логин = ТекущийПользователь.АдресЭлектроннойПочты;
	ПользовательID = ТекущийПользователь.УникальныйИдентификатор;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура URLПриИзменении(Элемент)
	URLПриИзмененииНаСервере(БазовыйURL);
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура Войти(Команда)
	
	Успешно = EPA_ВзаимодействиеHTTP.Авторизоваться(Логин, Пароль, ПользовательID);
	
	Если Успешно Тогда
		Закрыть(Истина);
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура URLПриИзмененииНаСервере(URL)
	Константы.EPA_URL.Установить(URL);
КонецПроцедуры  
#КонецОбласти
