Функция СоздатьУстройство(IDУстройтсва) Экспорт
	
	НайденныйЭлемент = НайтиПоРеквизиту("IDУстройтсва", IDУстройтсва);
	Если НайденныйЭлемент <> Справочники.EPA_УстройстваПользователей.ПустаяСсылка() Тогда
		Возврат Справочники.EPA_УстройстваПользователей.ПустаяСсылка();	
	КонецЕсли;
	
	НовыйЭлемент = СоздатьЭлемент();
	НовыйЭлемент.УстановитьНовыйКод();
	НовыйЭлемент.IDУстройтсва = IDУстройтсва;
	НовыйЭлемент.Наименование = IDУстройтсва;
	НовыйЭлемент.Записать();
	
	Возврат НовыйЭлемент.Ссылка; 
	
КонецФункции