&После("УстановкаПараметровСеанса")
Процедура EPA_УстановкаПараметровСеанса(ТребуемыеПараметры)
	
	ПараметрыСеанса.EPA_ТокенДоступа = "";
	
	ТекущийПользователь = Пользователи.ТекущийПользователь(); 
	ТекущийПользовательСистемы = ПользователиИнформационнойБазы.ТекущийПользователь();
	ХешПароля = ТекущийПользовательСистемы.СохраняемоеЗначениеПароля;        
	
	Если НЕ ТекущийПользовательСистемы.Роли.Содержит(Метаданные.Роли.EPA_Администратор) Тогда 
		
		ДанныеПользователя = РегистрыСведений.EPA_НастройкиПользователей.ПолучитьДанныеПользователя(ТекущийПользователь);
		
		Если ДанныеПользователя <> Неопределено Тогда
			EPA_ВзаимодействиеHTTP.Авторизоваться(ДанныеПользователя.email, ХешПароля, ДанныеПользователя.EPA_ID);  
		Иначе
			ПараметрыСеанса.EPA_ТокенДоступа = "";	
		КонецЕсли;
		
	Иначе
		
		ПараметрыСеанса.EPA_ТокенДоступа = "";	
		
	КонецЕсли;
	
КонецПроцедуры