Процедура ЗаполнитьДанныеПользователя(Пользователь, ДанныеПользователя) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.Пользователь = Пользователь;
	Если ТипЗнч(ДанныеПользователя) = Тип("Структура") Тогда
		НоваяЗапись.email = ДанныеПользователя.email;
		НоваяЗапись.EPA_ID = ДанныеПользователя.id;
		НоваяЗапись.ИнтегрированСEPAction  = Истина;
		НоваяЗапись.СложностьЗаданий = Перечисления.EPA_СложностьЗаданий.ПолучитьЗначениеПеречисления(ДанныеПользователя.task_type); 
		
		device_id = ДанныеПользователя.Свойство("device_id");
		
		Если device_id Тогда
			НоваяЗапись.Устройство = Справочники.EPA_УстройстваПользователей.СоздатьУстройство(ДанныеПользователя.device_id);		
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеПользователя) = Тип("Соответствие") Тогда 
		НоваяЗапись.email = ДанныеПользователя.Получить("email");
		НоваяЗапись.EPA_ID = ДанныеПользователя.Получить("id");
		НоваяЗапись.ИнтегрированСEPAction  = Истина;
		НоваяЗапись.СложностьЗаданий = Перечисления.EPA_СложностьЗаданий.ПолучитьЗначениеПеречисления(ДанныеПользователя.Получить("task_type"));
		device_id = ДанныеПользователя.Получить("device_id");
		
		Если device_id <> Неопределено Тогда
			НоваяЗапись.Устройство = Справочники.EPA_УстройстваПользователей.СоздатьУстройство(device_id);		
		КонецЕсли;
		
	КонецЕсли;
	НаборЗаписей.Записать();

КонецПроцедуры

Функция ПолучитьДанныеПользователя(Пользователь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	EPA_НастройкиПользователей.EPA_ID КАК EPA_ID,
		|	EPA_НастройкиПользователей.email КАК email,
		|	EPA_НастройкиПользователей.Пользователь КАК Пользователь
		|ИЗ
		|	РегистрСведений.EPA_НастройкиПользователей КАК EPA_НастройкиПользователей
		|ГДЕ
		|	EPA_НастройкиПользователей.ИнтегрированСEPAction
		|	И EPA_НастройкиПользователей.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь); 
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;		
	КонецЕсли;
	
	Запись = РезультатЗапроса.Выбрать();
	Запись.Следующий();
	
	Возврат Новый Структура("Пользователь, EPA_ID, email", Запись.Пользователь, Запись.EPA_ID, Запись.email);
	
КонецФункции