
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТокенДоступаПолучен = ЗначениеЗаполнено(ПараметрыСеанса.EPA_ТокенДоступа);
    ЗаполнитьПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)     
	
	Если НЕ ТокенДоступаПолучен Тогда 
		ЭтаФорма.ТолькоПросмотр = Истина;
		Элементы.ТаблицаПользователи.Видимость = Ложь;
	КонецЕсли;     
	
КонецПроцедуры 

&НаКлиенте
Процедура ОО_ЗаверешениеАвторизации(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли; 
	
	Если РезультатЗакрытия Тогда
		ЭтаФорма.ТолькоПросмотр = Ложь;
		Элементы.ФормаАвторизоваться.Видимость = Ложь;
		Элементы.ТаблицаПользователи.Видимость = Истина;
		Возврат;
	Иначе
		ЭтаФорма.ТолькоПросмотр = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Авторизоваться(Команда)
	
	ЗаверешениеАвторизации = Новый ОписаниеОповещения("ОО_ЗаверешениеАвторизации", ЭтаФорма);
	ОткрытьФорму("ОбщаяФорма.EPA_ФормаАвторизации", , ЭтаФорма,,,, ЗаверешениеАвторизации);	
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьПользователей()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Пользователь,
		|	EPA_НастройкиПользователей.ИнтегрированСEPAction КАК ИнтегрированСEPAction,
		|	EPA_НастройкиПользователей.СложностьЗаданий КАК Сложность,
		|	EPA_НастройкиПользователей.Устройство КАК Устройство
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.EPA_НастройкиПользователей КАК EPA_НастройкиПользователей
		|		ПО Пользователи.Ссылка = EPA_НастройкиПользователей.Пользователь";
	
	РезультатЗапроса = Запрос.Выполнить();
	Данные = РезультатЗапроса.Выгрузить();
	
	Объект.ТаблицаПользователи.Загрузить(Данные);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегеистрироватьПользователей(Команда)   
	
	МассивВыделенныхСтрок = Элементы.ТаблицаПользователи.ВыделенныеСтроки; 
	МассивПользователей = Новый Массив;
	
	Для Каждого ВыделеннаяСтрока Из МассивВыделенныхСтрок Цикл
		СтрокаДанных = Объект.ТаблицаПользователи.НайтиПоИдентификатору(ВыделеннаяСтрока); 
		
		Если НЕ СтрокаДанных.ИнтегрированСEPAction Тогда 
			МассивПользователей.Добавить(Новый Структура("Пользователь, УровеньЗаданй", СтрокаДанных.Пользователь, СтрокаДанных.Сложность));
		КонецЕсли;
		
	КонецЦикла;
	
	EPA_ВзаимодействиеHTTP.ЗарегестироватьМассивПользователей(МассивПользователей);
	
	ОбновитьДанныеПользователей(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьПользователя(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПривязатьУстройство(Команда)
	
	Если Элементы.ТаблицаПользователи.ТекущиеДанные.ИнтегрированСEPAction Тогда
		ОткрытьФорму("ОбщаяФорма.EPA_ФормаГенерацииКода",, ЭтаФорма);
	Иначе
		ПоказатьПредупреждение(, "Операция запрещена для не зарегестрированного пользователя!", 10, "Операция запрещена!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеПользователей(Команда)
	Результат = EPA_ВзаимодействиеHTTP.ЗапроситьДанныеПользователей();
	Если Результат.Успешно Тогда
		ЗаполнитьПользователей();	
	КонецЕсли;
КонецПроцедуры
